<a href="https://colab.research.google.com/github/deviramasamy/Python/blob/main/Pandas_training_1_2_23.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [14]:
import pandas as pd

data =pd.read_csv("/content/Bigmarket.csv")
#print(date)
print(data.head())#1ast 5 records
print(data.tail())#last 5 records

#to find how many rows and columns
print(data.shape)
print(data.info())

print(data.describe())

  Month Store  Sales
0   Jan     A  31037
1   Jan     B  20722
2   Jan     C  24557
3   Jan     D  34649
4   Jan     E  29795
   Month Store  Sales
20   May     A  29487
21   May     B  40001
22   May     C  46482
23   May     D  46313
24   May     E  47594
(25, 3)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Month   25 non-null     object
 1   Store   25 non-null     object
 2   Sales   25 non-null     int64
dtypes: int64(1), object(2)
memory usage: 728.0+ bytes
None
             Sales
count     25.00000
mean   34318.44000
std     8604.09835
min    20722.00000
25%    28312.00000
50%    31874.00000
75%    40241.00000
max    47814.00000

In [26]:
#specific column to see
print(data[['Sales','Month']])

Month      Jan
Store        B
Sales    20722
Name: 1, dtype: object

In [32]:
#to find the index location-iloc function
print(data.iloc[1])
print(data.iloc[2:5]['Sales'])

Month      Jan
Store        B
Sales    20722
Name: 1, dtype: object
2    24557
3    34649
4    29795
Name: Sales, dtype: int64

In [33]:
#filter the data
print(data[data.Sales>14000])

    Month Store  Sales
0     Jan     A  31037
1     Jan     B  20722
2     Jan     C  24557
3     Jan     D  34649
4     Jan     E  29795
5     Feb     A  29133
6     Feb     B  22695
7     Feb     C  28312
8     Feb     D  31454
9     Feb     E  46267
10  March     A  32961
11  March     B  26451
12  March     C  47814
13  March     D  36069
14  March     E  31874
15    Apr     A  27253
16    Apr     B  40241
17    Apr     C  47488
18    Apr     D  25432
19    Apr     E  33880
20    May     A  29487
21    May     B  40001
22    May     C  46482
23    May     D  46313
24    May     E  47594

In [36]:
#applying logical operators
print(data[(data.Sales >14000) & (data.Month=='Feb')])

  Month Store  Sales
5   Feb     A  29133
6   Feb     B  22695
7   Feb     C  28312
8   Feb     D  31454
9   Feb     E  46267

In [44]:
#sorting data
print(data.sort_values('Sales'))
#Descending order
print(data.sort_values('Sales',ascending=False))

    Month Store  Sales
1     Jan     B  20722
6     Feb     B  22695
2     Jan     C  24557
18    Apr     D  25432
11  March     B  26451
15    Apr     A  27253
7     Feb     C  28312
5     Feb     A  29133
20    May     A  29487
4     Jan     E  29795
0     Jan     A  31037
8     Feb     D  31454
14  March     E  31874
10  March     A  32961
19    Apr     E  33880
3     Jan     D  34649
13  March     D  36069
21    May     B  40001
16    Apr     B  40241
9     Feb     E  46267
23    May     D  46313
22    May     C  46482
17    Apr     C  47488
24    May     E  47594
12  March     C  47814
    Month Store  Sales
12  March     C  47814
24    May     E  47594
17    Apr     C  47488
22    May     C  46482
23    May     D  46313
9     Feb     E  46267
16    Apr     B  40241
21    May     B  40001
13  March     D  36069
3     Jan     D  34649
19    Apr     E  33880
10  March     A  32961
14  March     E  31874
8     Feb     D  31454
0     Jan     A  31037
4     Jan     E  29795
20    May     A  29487
5     Feb     A  29133
7     Feb     C  28312
15    Apr     A  27253
11  March     B  26451
18    Apr     D  25432
2     Jan     C  24557
6     Feb     B  22695
1     Jan     B  20722

In [50]:
#sorting with specific rows
print(data.sort_values('Sales').iloc[:3])
print(data.sort_values('Sales')[0:3])
print(data.sort_values(['Store','Sales']))

  Month Store  Sales
1   Jan     B  20722
6   Feb     B  22695
2   Jan     C  24557
  Month Store  Sales
1   Jan     B  20722
6   Feb     B  22695
2   Jan     C  24557
    Month Store  Sales
15    Apr     A  27253
5     Feb     A  29133
20    May     A  29487
0     Jan     A  31037
10  March     A  32961
1     Jan     B  20722
6     Feb     B  22695
11  March     B  26451
21    May     B  40001
16    Apr     B  40241
2     Jan     C  24557
7     Feb     C  28312
22    May     C  46482
17    Apr     C  47488
12  March     C  47814
18    Apr     D  25432
8     Feb     D  31454
3     Jan     D  34649
13  March     D  36069
23    May     D  46313
4     Jan     E  29795
14  March     E  31874
19    Apr     E  33880
9     Feb     E  46267
24    May     E  47594

In [59]:
#Insert data into the list
#create new Dataframe
dic1={'Month':['Jun','Jun','Jun','Jun','Jun',],
       'Store':['A','B','C','D','E'],
       'Sales':[20000,35000,56000,34000,67000]
       }
     
dic2=pd.DataFrame(dic1)   
print(dic2) 

#append 2 Dataframe and ignore the index

print(data.append(dic2,ignore_index=True))

#another way-concat

print(pd.concat([data,dic2],ignore_index=True))

  Month Store  Sales
0   Jun     A  20000
1   Jun     B  35000
2   Jun     C  56000
3   Jun     D  34000
4   Jun     E  67000
    Month Store  Sales
0     Jan     A  31037
1     Jan     B  20722
2     Jan     C  24557
3     Jan     D  34649
4     Jan     E  29795
5     Feb     A  29133
6     Feb     B  22695
7     Feb     C  28312
8     Feb     D  31454
9     Feb     E  46267
10  March     A  32961
11  March     B  26451
12  March     C  47814
13  March     D  36069
14  March     E  31874
15    Apr     A  27253
16    Apr     B  40241
17    Apr     C  47488
18    Apr     D  25432
19    Apr     E  33880
20    May     A  29487
21    May     B  40001
22    May     C  46482
23    May     D  46313
24    May     E  47594
25    Jun     A  20000
26    Jun     B  35000
27    Jun     C  56000
28    Jun     D  34000
29    Jun     E  67000
    Month Store  Sales
0     Jan     A  31037
1     Jan     B  20722
2     Jan     C  24557
3     Jan     D  34649
4     Jan     E  29795
5     Feb     A  29133
6     Feb     B  22695
7     Feb     C  28312
8     Feb     D  31454
9     Feb     E  46267
10  March     A  32961
11  March     B  26451
12  March     C  47814
13  March     D  36069
14  March     E  31874
15    Apr     A  27253
16    Apr     B  40241
17    Apr     C  47488
18    Apr     D  25432
19    Apr     E  33880
20    May     A  29487
21    May     B  40001
22    May     C  46482
23    May     D  46313
24    May     E  47594
25    Jun     A  20000
26    Jun     B  35000
27    Jun     C  56000
28    Jun     D  34000
29    Jun     E  67000

In [66]:
#to add columns to the list
state1=['Alaska','Delhi','Bombay','Kolkata','Chennai']
state2=state1*5
state3={'state':state2}
newcol_state=pd.DataFrame(state3)
print(pd.concat([data,newcol_state],axis=1))

    Month Store  Sales    state
0     Jan     A  31037   Alaska
1     Jan     B  20722    Delhi
2     Jan     C  24557   Bombay
3     Jan     D  34649  Kolkata
4     Jan     E  29795  Chennai
5     Feb     A  29133   Alaska
6     Feb     B  22695    Delhi
7     Feb     C  28312   Bombay
8     Feb     D  31454  Kolkata
9     Feb     E  46267  Chennai
10  March     A  32961   Alaska
11  March     B  26451    Delhi
12  March     C  47814   Bombay
13  March     D  36069  Kolkata
14  March     E  31874  Chennai
15    Apr     A  27253   Alaska
16    Apr     B  40241    Delhi
17    Apr     C  47488   Bombay
18    Apr     D  25432  Kolkata
19    Apr     E  33880  Chennai
20    May     A  29487   Alaska
21    May     B  40001    Delhi
22    May     C  46482   Bombay
23    May     D  46313  Kolkata
24    May     E  47594  Chennai

In [73]:
#aggregate function

print(data['Sales'].sum())
print(data['Sales'].mean())
print(data['Sales'].max())
print(data['Sales'].min())
#If we want all in one we can use describe()
print(data.describe())
#count
print(data['Month'].value_counts())

857961
34318.44
47814
20722
             Sales
count     25.00000
mean   34318.44000
std     8604.09835
min    20722.00000
25%    28312.00000
50%    31874.00000
75%    40241.00000
max    47814.00000
Jan      5
Feb      5
March    5
Apr      5
May      5
Name: Month, dtype: int64

In [82]:
#Update/replace a value with another value
#11  March     B  26451    Delhi

newdata=data['Sales'].replace([26451],50000)
print(newdata)

0     31037
1     20722
2     24557
3     34649
4     29795
5     29133
6     22695
7     28312
8     31454
9     46267
10    32961
11    50000
12    47814
13    36069
14    31874
15    27253
16    40241
17    47488
18    25432
19    33880
20    29487
21    40001
22    46482
23    46313
24    47594
Name: Sales, dtype: int64